//+++++++++++++++++++++++Консоль(отправлено и .сpp++++++++++++++++++++++++++++++++++++++++
//+++ Вызывается из menu->Допололнительная информация или по нажатию клавиш Ctrl+W     +++
//+++ Описывает все операции,связанные с консолью, выводимую информацию, стиль         +++
//+++  Наследуется от QPlainTextEdit                                                   +++
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//------------------------------------------------------------------------------Светлов Я.


#include "consoll.h"
#include<QScrollBar>            //добавление колеса прокрутки
#include <QtCore/QDebug>        // предполагается, что по своей сути, консоль будет функционировать как debug

consoll::consoll(QWidget *parent)
    : QPlainTextEdit(parent)

{
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Стиль  и размер консоли~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    p = palette();                                 //объявление свойства "Палитры" - позволяет менять цветовую гамму виджета
    p.setColor(QPalette::Base, Qt::lightGray);              //Задний фон - светло-серый
    p.setColor(QPalette::Base, Qt::lightGray);              //Задний фон - светло-серый

    setPalette(p);              //Текст - синий


    document()->setMaximumBlockCount(5000);                  //определяет максимальное кол-во блоков, которое может иметь документ



        connect(this,SIGNAL(showcommandTimeSignal()),this,SLOT(showcommandTime()));

}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------




//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Вывод времени запуска ПО и приветсвия после очистки~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void consoll::afterclean()
{
                // тут как бэ ничего не выводится
}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------




//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Вывод текущего времени на экран консоли~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

void consoll::showcommandTime(){



    QTime whatTime= QTime::currentTime();                       //Запрашивает значение системных часов
    QString formofTime="hh:mm:ss";                              //Определение формата времени
    QString whatTimeString=whatTime.toString(formofTime);       //Создание переменной типа строка - в которую записывается значение времени
    insertPlainText(whatTimeString+"\t");                       // Вывод времени на экран

}
//---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------



//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Вывод информации об отправленном сообщении в соответсвующую консоль с надписью ОТПРАВЛЕНО~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void consoll::putDataSend(QString data)
{
    p.setColor(QPalette::Text, Qt::blue);                   //Текст - синий
    setPalette(p);                                          // Установка цвета
    emit showcommandTimeSignal();                               //Вызывается сигнал, который вызывает слот, который показывает время
    insertPlainText(data+"\n");                                 //Вывод данных на экран консоли
    QScrollBar *bar = verticalScrollBar();                  // В случае переполнения  - появляется скролл
    bar->setValue(bar->maximum());
}
//----------------------------------------------------------------------------------------------------------------------------


//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Вывод информации об доставленном сообщении в соответсвующую консоль с надписью ПРИНЯТО~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void consoll::putDataArrive(QString data)
{
   p.setColor(QPalette::Text, Qt::darkGreen);                   //Текст - темно зеленый
   setPalette(p);                                               // Установка цвета
   emit showcommandTimeSignal();                               //Вызывается сигнал, который вызывает слот, который показывает время
   insertPlainText(data+"\n");                                 //Вывод данных на экран консоли
   QScrollBar *bar = verticalScrollBar();                  // В случае переполнения  - появляется скролл
   bar->setValue(bar->maximum());
}

//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------




//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Эти функции не позволяют а стирать и вводить информацию в консоль.~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
void consoll::keyPressEvent(QKeyEvent *e)
{
        Q_UNUSED(e)
}
void consoll::mousePressEvent(QMouseEvent *e)
{
        Q_UNUSED(e)
}
void consoll::mouseDoubleClickEvent(QMouseEvent *e)
{
        Q_UNUSED(e)
}
void consoll::contextMenuEvent(QContextMenuEvent *e)
{
        Q_UNUSED(e)
}
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

